{
  "title": "A Deep Neural Network for Unsupervised Anomaly Detection and Diagnosis\n  in Multivariate Time Series Data",
  "authors": "Chuxu Zhang, Dongjin Song, Yuncong Chen, Xinyang Feng, Cristian Lumezanu, Wei Cheng, Jingchao Ni, Bo Zong, Haifeng Chen, Nitesh V. Chawla",
  "year": 2018,
  "url": "http://arxiv.org/abs/1811.08055v1",
  "abstract": "Nowadays, multivariate time series data are increasingly collected in various\nreal world systems, e.g., power plants, wearable devices, etc. Anomaly\ndetection and diagnosis in multivariate time series refer to identifying\nabnormal status in certain time steps and pinpointing the root causes. Building\nsuch a system, however, is challenging since it not only requires to capture\nthe temporal dependency in each time series, but also need encode the\ninter-correlations between different pairs of time series. In addition, the\nsystem should be robust to noise and provide operators with different levels of\nanomaly scores based upon the severity of different incidents. Despite the fact\nthat a number of unsupervised anomaly detection algorithms have been developed,\nfew of them can jointly address these challenges. In this paper, we propose a\nMulti-Scale Convolutional Recurrent Encoder-Decoder (MSCRED), to perform\nanomaly detection and diagnosis in multivariate time series data. Specifically,\nMSCRED first constructs multi-scale (resolution) signature matrices to\ncharacterize multiple levels of the system statuses in different time steps.\nSubsequently, given the signature matrices, a convolutional encoder is employed\nto encode the inter-sensor (time series) correlations and an attention based\nConvolutional Long-Short Term Memory (ConvLSTM) network is developed to capture\nthe temporal patterns. Finally, based upon the feature maps which encode the\ninter-sensor correlations and temporal information, a convolutional decoder is\nused to reconstruct the input signature matrices and the residual signature\nmatrices are further utilized to detect and diagnose anomalies. Extensive\nempirical studies based on a synthetic dataset and a real power plant dataset\ndemonstrate that MSCRED can outperform state-of-the-art baseline methods.",
  "citation": 1148
}