{
  "title": "A Comprehensive Survey of Deep Transfer Learning for Anomaly Detection\n  in Industrial Time Series: Methods, Applications, and Directions",
  "authors": "Peng Yan, Ahmed Abdulkadir, Paul-Philipp Luley, Matthias Rosenthal, Gerrit A. Schatte, Benjamin F. Grewe, Thilo Stadelmann",
  "year": 2023,
  "url": "http://arxiv.org/abs/2307.05638v2",
  "abstract": "Automating the monitoring of industrial processes has the potential to\nenhance efficiency and optimize quality by promptly detecting abnormal events\nand thus facilitating timely interventions. Deep learning, with its capacity to\ndiscern non-trivial patterns within large datasets, plays a pivotal role in\nthis process. Standard deep learning methods are suitable to solve a specific\ntask given a specific type of data. During training, deep learning demands\nlarge volumes of labeled data. However, due to the dynamic nature of the\nindustrial processes and environment, it is impractical to acquire large-scale\nlabeled data for standard deep learning training for every slightly different\ncase anew. Deep transfer learning offers a solution to this problem. By\nleveraging knowledge from related tasks and accounting for variations in data\ndistributions, the transfer learning framework solves new tasks with little or\neven no additional labeled data. The approach bypasses the need to retrain a\nmodel from scratch for every new setup and dramatically reduces the labeled\ndata requirement. This survey first provides an in-depth review of deep\ntransfer learning, examining the problem settings of transfer learning and\nclassifying the prevailing deep transfer learning methods. Moreover, we delve\ninto applications of deep transfer learning in the context of a broad spectrum\nof time series anomaly detection tasks prevalent in primary industrial domains,\ne.g., manufacturing process monitoring, predictive maintenance, energy\nmanagement, and infrastructure facility monitoring. We discuss the challenges\nand limitations of deep transfer learning in industrial contexts and conclude\nthe survey with practical directions and actionable suggestions to address the\nneed to leverage diverse time series data for anomaly detection in an\nincreasingly dynamic production environment.",
  "citation": 158
}