{
  "title": "TadGAN: Time Series Anomaly Detection Using Generative Adversarial\n  Networks",
  "authors": "Alexander Geiger, Dongyu Liu, Sarah Alnegheimish, Alfredo Cuesta-Infante, Kalyan Veeramachaneni",
  "year": 2020,
  "url": "http://arxiv.org/abs/2009.07769v3",
  "abstract": "Time series anomalies can offer information relevant to critical situations\nfacing various fields, from finance and aerospace to the IT, security, and\nmedical domains. However, detecting anomalies in time series data is\nparticularly challenging due to the vague definition of anomalies and said\ndata's frequent lack of labels and highly complex temporal correlations.\nCurrent state-of-the-art unsupervised machine learning methods for anomaly\ndetection suffer from scalability and portability issues, and may have high\nfalse positive rates. In this paper, we propose TadGAN, an unsupervised anomaly\ndetection approach built on Generative Adversarial Networks (GANs). To capture\nthe temporal correlations of time series distributions, we use LSTM Recurrent\nNeural Networks as base models for Generators and Critics. TadGAN is trained\nwith cycle consistency loss to allow for effective time-series data\nreconstruction. We further propose several novel methods to compute\nreconstruction errors, as well as different approaches to combine\nreconstruction errors and Critic outputs to compute anomaly scores. To\ndemonstrate the performance and generalizability of our approach, we test\nseveral anomaly scoring techniques and report the best-suited one. We compare\nour approach to 8 baseline anomaly detection methods on 11 datasets from\nmultiple reputable sources such as NASA, Yahoo, Numenta, Amazon, and Twitter.\nThe results show that our approach can effectively detect anomalies and\noutperform baseline methods in most cases (6 out of 11). Notably, our method\nhas the highest averaged F1 score across all the datasets. Our code is open\nsource and is available as a benchmarking tool.",
  "citation": 483
}