{
  "title": "On the Interaction Between Deep Detectors and Siamese Trackers in Video\n  Surveillance",
  "authors": "Madhu Kiran, Vivek Tiwari, Le Thanh Nguyen-Meidine, Eric Granger",
  "year": 2019,
  "url": "http://arxiv.org/abs/1910.14552v1",
  "abstract": "Visual object tracking is an important function in many real-time video\nsurveillance applications, such as localization and spatio-temporal recognition\nof persons. In real-world applications, an object detector and tracker must\ninteract on a periodic basis to discover new objects, and thereby to initiate\ntracks. Periodic interactions with the detector can also allow the tracker to\nvalidate and/or update its object template with new bounding boxes. However,\nbounding boxes provided by a state-of-the-art detector are noisy, due to\nchanges in appearance, background and occlusion, which can cause the tracker to\ndrift. Moreover, CNN-based detectors can provide a high level of accuracy at\nthe expense of computational complexity, so interactions should be minimized\nfor real-time applications.\n  In this paper, a new approach is proposed to manage detector-tracker\ninteractions for trackers from the Siamese-FC family. By integrating a change\ndetection mechanism into a deep Siamese-FC tracker, its template can be adapted\nin response to changes in a target's appearance that lead to drifts during\ntracking. An abrupt change detection triggers an update of tracker template\nusing the bounding box produced by the detector, while in the case of a gradual\nchange, the detector is used to update an evolving set of templates for robust\nmatching.\n  Experiments were performed using state-of-the-art Siamese-FC trackers and the\nYOLOv3 detector on a subset of videos from the OTB-100 dataset that mimic video\nsurveillance scenarios. Results highlight the importance for reliable VOT of\nusing accurate detectors. They also indicate that our adaptive Siamese trackers\nare robust to noisy object detections, and can significantly improve the\nperformance of Siamese-FC tracking."
}