{
  "title": "A Broader Study of Cross-Domain Few-Shot Learning",
  "authors": "Yunhui Guo, Noel C. Codella, Leonid Karlinsky, James V. Codella, John R. Smith, Kate Saenko, Tajana Rosing, Rogerio Feris",
  "year": 2019,
  "url": "http://arxiv.org/abs/1912.07200v3",
  "abstract": "Recent progress on few-shot learning largely relies on annotated data for\nmeta-learning: base classes sampled from the same domain as the novel classes.\nHowever, in many applications, collecting data for meta-learning is infeasible\nor impossible. This leads to the cross-domain few-shot learning problem, where\nthere is a large shift between base and novel class domains. While\ninvestigations of the cross-domain few-shot scenario exist, these works are\nlimited to natural images that still contain a high degree of visual\nsimilarity. No work yet exists that examines few-shot learning across different\nimaging methods seen in real world scenarios, such as aerial and medical\nimaging. In this paper, we propose the Broader Study of Cross-Domain Few-Shot\nLearning (BSCD-FSL) benchmark, consisting of image data from a diverse\nassortment of image acquisition methods. This includes natural images, such as\ncrop disease images, but additionally those that present with an increasing\ndissimilarity to natural images, such as satellite images, dermatology images,\nand radiology images. Extensive experiments on the proposed benchmark are\nperformed to evaluate state-of-art meta-learning approaches, transfer learning\napproaches, and newer methods for cross-domain few-shot learning. The results\ndemonstrate that state-of-art meta-learning methods are surprisingly\noutperformed by earlier meta-learning approaches, and all meta-learning methods\nunderperform in relation to simple fine-tuning by 12.8% average accuracy.\nPerformance gains previously observed with methods specialized for cross-domain\nfew-shot learning vanish in this more challenging benchmark. Finally, accuracy\nof all methods tend to correlate with dataset similarity to natural images,\nverifying the value of the benchmark to better represent the diversity of data\nseen in practice and guiding future research."
}