{
  "title": "A Multilayer Framework for Online Metric Learning",
  "authors": "Wenbin Li, Yanfang Liu, Jing Huo, Yinghuan Shi, Yang Gao, Lei Wang, Jiebo Luo",
  "year": 2018,
  "url": "http://arxiv.org/abs/1805.05510v3",
  "abstract": "Online metric learning has been widely applied in classification and\nretrieval. It can automatically learn a suitable metric from data by\nrestricting similar instances to be separated from dissimilar instances with a\ngiven margin. However, the existing online metric learning algorithms have\nlimited performance in real-world classifications, especially when data\ndistributions are complex. To this end, this paper proposes a multilayer\nframework for online metric learning to capture the nonlinear similarities\namong instances. Different from the traditional online metric learning, which\ncan only learn one metric space, the proposed Multi-Layer Online Metric\nLearning (MLOML) takes an online metric learning algorithm as a metric layer\nand learns multiple hierarchical metric spaces, where each metric layer follows\na nonlinear layers for the complicated data distribution. Moreover, the forward\npropagation (FP) strategy and backward propagation (BP) strategy are employed\nto train the hierarchical metric layers. To build a metric layer of the\nproposed MLOML, a new Mahalanobis-based Online Metric Learning (MOML) algorithm\nis presented based on the passive-aggressive strategy and one-pass triplet\nconstruction strategy. Furthermore, in a progressively and nonlinearly learning\nway, MLOML has a stronger learning ability than traditional online metric\nlearning in the case of limited available training data. To make the learning\nprocess more explainable and theoretically guaranteed, theoretical analysis is\nprovided. The proposed MLOML enjoys several nice properties, indeed learns a\nmetric progressively, and performs better on the benchmark datasets. Extensive\nexperiments with different settings have been conducted to verify these\nproperties of the proposed MLOML.",
  "citation": 1
}