{
  "title": "A Review of Deep Learning Techniques for Speech Processing",
  "authors": "Ambuj Mehrish, Navonil Majumder, Rishabh Bhardwaj, Rada Mihalcea, Soujanya Poria",
  "year": 2023,
  "url": "http://arxiv.org/abs/2305.00359v3",
  "abstract": "The field of speech processing has undergone a transformative shift with the\nadvent of deep learning. The use of multiple processing layers has enabled the\ncreation of models capable of extracting intricate features from speech data.\nThis development has paved the way for unparalleled advancements in speech\nrecognition, text-to-speech synthesis, automatic speech recognition, and\nemotion recognition, propelling the performance of these tasks to unprecedented\nheights. The power of deep learning techniques has opened up new avenues for\nresearch and innovation in the field of speech processing, with far-reaching\nimplications for a range of industries and applications. This review paper\nprovides a comprehensive overview of the key deep learning models and their\napplications in speech-processing tasks. We begin by tracing the evolution of\nspeech processing research, from early approaches, such as MFCC and HMM, to\nmore recent advances in deep learning architectures, such as CNNs, RNNs,\ntransformers, conformers, and diffusion models. We categorize the approaches\nand compare their strengths and weaknesses for solving speech-processing tasks.\nFurthermore, we extensively cover various speech-processing tasks, datasets,\nand benchmarks used in the literature and describe how different deep-learning\nnetworks have been utilized to tackle these tasks. Additionally, we discuss the\nchallenges and future directions of deep learning in speech processing,\nincluding the need for more parameter-efficient, interpretable models and the\npotential of deep learning for multimodal speech processing. By examining the\nfield's evolution, comparing and contrasting different approaches, and\nhighlighting future directions and challenges, we hope to inspire further\nresearch in this exciting and rapidly advancing field.",
  "citation": 375
}