{
  "title": "AGI: Artificial General Intelligence for Education",
  "authors": "Ehsan Latif, Gengchen Mai, Matthew Nyaaba, Xuansheng Wu, Ninghao Liu, Guoyu Lu, Sheng Li, Tianming Liu, Xiaoming Zhai",
  "year": 2023,
  "url": "http://arxiv.org/abs/2304.12479v5",
  "abstract": "Artificial general intelligence (AGI) has gained global recognition as a\nfuture technology due to the emergence of breakthrough large language models\nand chatbots such as GPT-4 and ChatGPT, respectively. Compared to conventional\nAI models, typically designed for a limited range of tasks, demand significant\namounts of domain-specific data for training and may not always consider\nintricate interpersonal dynamics in education. AGI, driven by the recent large\npre-trained models, represents a significant leap in the capability of machines\nto perform tasks that require human-level intelligence, such as reasoning,\nproblem-solving, decision-making, and even understanding human emotions and\nsocial interactions. This position paper reviews AGI's key concepts,\ncapabilities, scope, and potential within future education, including achieving\nfuture educational goals, designing pedagogy and curriculum, and performing\nassessments. It highlights that AGI can significantly improve intelligent\ntutoring systems, educational assessment, and evaluation procedures. AGI\nsystems can adapt to individual student needs, offering tailored learning\nexperiences. They can also provide comprehensive feedback on student\nperformance and dynamically adjust teaching methods based on student progress.\nThe paper emphasizes that AGI's capabilities extend to understanding human\nemotions and social interactions, which are critical in educational settings.\nThe paper discusses that ethical issues in education with AGI include data\nbias, fairness, and privacy and emphasizes the need for codes of conduct to\nensure responsible AGI use in academic settings like homework, teaching, and\nrecruitment. We also conclude that the development of AGI necessitates\ninterdisciplinary collaborations between educators and AI engineers to advance\nresearch and application efforts.",
  "citation": 156
}