{
  "title": "An overview of research on human-centered design in the development of\n  artificial general intelligence",
  "authors": "Yang Yue, Joseph Z. Shyu",
  "year": 2023,
  "url": "http://arxiv.org/abs/2309.12352v1",
  "abstract": "Abstract: This article offers a comprehensive analysis of Artificial General\nIntelligence (AGI) development through a humanistic lens. Utilizing a wide\narray of academic and industry resources, it dissects the technological and\nethical complexities inherent in AGI's evolution. Specifically, the paper\nunderlines the societal and individual implications of AGI and argues for its\nalignment with human values and interests.\n  Purpose: The study aims to explore the role of human-centered design in AGI's\ndevelopment and governance.\n  Design/Methodology/Approach: Employing content analysis and literature\nreview, the research evaluates major themes and concepts in human-centered\ndesign within AGI development. It also scrutinizes relevant academic studies,\ntheories, and best practices.\n  Findings: Human-centered design is imperative for ethical and sustainable\nAGI, emphasizing human dignity, privacy, and autonomy. Incorporating values\nlike empathy, ethics, and social responsibility can significantly influence\nAGI's ethical deployment. Talent development is also critical, warranting\ninterdisciplinary initiatives.\n  Research Limitations/Implications: There is a need for additional empirical\nstudies focusing on ethics, social responsibility, and talent cultivation\nwithin AGI development.\n  Practical Implications: Implementing human-centered values in AGI development\nenables ethical and sustainable utilization, thus promoting human dignity,\nprivacy, and autonomy. Moreover, a concerted effort across industry, academia,\nand research sectors can secure a robust talent pool, essential for AGI's\nstable advancement.\n  Originality/Value: This paper contributes original research to the field by\nhighlighting the necessity of a human-centered approach in AGI development, and\ndiscusses its practical ramifications.",
  "citation": 12
}