{
  "title": "Hype and Adoption of Generative Artificial Intelligence Applications",
  "authors": "Vinh Truong",
  "year": 2025,
  "url": "http://arxiv.org/abs/2504.18081v1",
  "abstract": "New technologies create opportunities while displacing others. They enhance\nlife by supporting entertainment, education, and social connectivity but also\nreplace humans in productivity and analytical tasks. Adapting to these shifts\nrequires technical adjustments and social readiness. For digital transformation\nto succeed, organizations and their workforce must be psychologically prepared.\nWe are entering the era of Generative AI with tools like ChatGPT, Bing AI, and\nMicrosoft Office Copilot. Understanding public sentiment toward these\ninnovations is crucial for refining technology acceptance models and informing\nmarket strategies. Using the Gartner Hype Cycle and Kubler-Ross Change Curve,\nthis study suggests that generative AI adoption is a dual-stage process. It\nfollows the phases of technology trigger, peak of expectations, trough of\ndisillusionment, slope of enlightenment, and plateau of productivity, while\nalso reflecting emotional stages like shock, denial, and integration. The study\nused sentiment and emotion analysis on a large dataset of tweets about\ngenerative AI, translating them into scores to track user responses over time.\nUnlike prior research, which offered a snapshot of sentiment, this study\ncaptures the dynamic evolution of attitudes, linking empirical evidence with\ntheoretical frameworks. It shifts the focus from information seekers to content\ncreators. With the release of generative AI tools, there is a significant gap\nin understanding societal reception and adaptation. Policymakers face\nuncertainty about guiding markets for these changes. This research validates\nthe applicability of the Gartner Hype Cycle and Kubler-Ross Change Curve to\ngenerative AI. It provides insights for businesses in integrating these tools\nand crafting policies to enhance readiness and resilience."
}