{
  "title": "From the Pursuit of Universal AGI Architecture to Systematic Approach to\n  Heterogenous AGI: Addressing Alignment, Energy, & AGI Grand Challenges",
  "authors": "Eren Kurshan",
  "year": 2023,
  "url": "http://arxiv.org/abs/2310.15274v3",
  "abstract": "Artificial intelligence (AI) faces a trifecta of grand challenges: the Energy\nWall, the Alignment Problem and the Leap from Narrow AI to AGI. We present\nSAGI, a Systematic Approach to AGI that utilizes system design principles to\novercome the energy wall and alignment challenges. This paper asserts that AGI\ncan be realized through multiplicity of design specific pathways and customized\nthrough system design rather than a singular overarching architecture. AGI\nsystems may exhibit diver architectural configurations and capabilities,\ncontingent upon their intended use cases. Alignment, a challenge broadly\nrecognized as AIs most formidable, is the one that depends most critically on\nsystem design and serves as its primary driving force as a foundational\ncriterion for AGI. Capturing the complexities of human morality for alignment\nrequires architectural support to represent the intricacies of moral\ndecision-making and the pervasive ethical processing at every level, with\nperformance reliability exceeding that of human moral judgment. Hence,\nrequiring a more robust architecture towards safety and alignment goals,\nwithout replicating or resembling the human brain.\n  We argue that system design (such as feedback loops, energy and performance\noptimization) on learning substrates (capable of learning its system\narchitecture) is more fundamental to achieving AGI goals and guarantees,\nsuperseding classical symbolic, emergentist and hybrid approaches. Through\nlearning of the system architecture itself, the resulting AGI is not a product\nof spontaneous emergence but of systematic design and deliberate engineering,\nwith core features, including an integrated moral architecture, deeply embedded\nwithin its architecture. The approach aims to guarantee design goals such as\nalignment, efficiency by self-learning system architecture.",
  "citation": 3
}