{
  "title": "Sleep Staging Based on Multi Scale Dual Attention Network",
  "authors": "Huafeng Wang, Chonggang Lu, Qi Zhang, Zhimin Hu, Xiaodong Yuan, Pingshu Zhang, Wanquan Liu",
  "year": 2021,
  "url": "http://arxiv.org/abs/2107.08442v2",
  "abstract": "Sleep staging plays an important role on the diagnosis of sleep disorders. In\ngeneral, experts classify sleep stages manually based on polysomnography (PSG),\nwhich is quite time-consuming. Meanwhile, the acquisition process of multiple\nsignals is much complex, which can affect the subject's sleep. Therefore, the\nuse of single-channel electroencephalogram (EEG) for automatic sleep staging\nhas become a popular research topic. In the literature, a large number of sleep\nstaging methods based on single-channel EEG have been proposed with promising\nresults and achieve the preliminary automation of sleep staging. However, the\nperformance for most of these methods in the N1 stage do not satisfy the needs\nof the diagnosis. In this paper, we propose a deep learning model multi scale\ndual attention network(MSDAN) based on raw EEG, which utilizes multi-scale\nconvolution to extract features in different waveforms contained in the EEG\nsignal, connects channel attention and spatial attention mechanisms in series\nto filter and highlight key information, and uses soft thresholding to remove\nredundant information. Experiments were conducted using two datasets with\n5-fold cross-validation and hold-out validation method. The final average\naccuracy, overall accuracy, macro F1 score and Cohen's Kappa coefficient of the\nmodel reach 96.70%, 91.74%, 0.8231 and 0.8723 on the Sleep-EDF dataset, 96.14%,\n90.35%, 0.7945 and 0.8284 on the Sleep-EDFx dataset. Significantly, our model\nperformed superiorly in the N1 stage, with F1 scores of 54.41% and 52.79% on\nthe two datasets respectively. The results show the superiority of our network\nover the existing methods, reaching a new state-of-the-art. In particular, the\nproposed method achieves excellent results in the N1 sleep stage compared to\nother methods.",
  "citation": 2
}