{
  "title": "Impact of Physical Activity on Sleep:A Deep Learning Based Exploration",
  "authors": "Aarti Sathyanarayana, Shafiq Joty, Luis Fernandez-Luque, Ferda Ofli, Jaideep Srivastava, Ahmed Elmagarmid, Shahrad Taheri, Teresa Arora",
  "year": 2016,
  "url": "http://arxiv.org/abs/1607.07034v1",
  "abstract": "The importance of sleep is paramount for maintaining physical, emotional and\nmental wellbeing. Though the relationship between sleep and physical activity\nis known to be important, it is not yet fully understood. The explosion in\npopularity of actigraphy and wearable devices, provides a unique opportunity to\nunderstand this relationship. Leveraging this information source requires new\ntools to be developed to facilitate data-driven research for sleep and activity\npatient-recommendations.\n  In this paper we explore the use of deep learning to build sleep quality\nprediction models based on actigraphy data. We first use deep learning as a\npure model building device by performing human activity recognition (HAR) on\nraw sensor data, and using deep learning to build sleep prediction models. We\ncompare the deep learning models with those build using classical approaches,\ni.e. logistic regression, support vector machines, random forest and adaboost.\nSecondly, we employ the advantage of deep learning with its ability to handle\nhigh dimensional datasets. We explore several deep learning models on the raw\nwearable sensor output without performing HAR or any other feature extraction.\n  Our results show that using a convolutional neural network on the raw\nwearables output improves the predictive value of sleep quality from physical\nactivity, by an additional 8% compared to state-of-the-art non-deep learning\napproaches, which itself shows a 15% improvement over current practice.\nMoreover, utilizing deep learning on raw data eliminates the need for data\npre-processing and simplifies the overall workflow to analyze actigraphy data\nfor sleep and physical activity research.",
  "citation": 42
}