{
  "title": "Deep Learning for Sleep Stages Classification: Modified Rectified Linear\n  Unit Activation Function and Modified Orthogonal Weight Initialisation",
  "authors": "Akriti Bhusal, Abeer Alsadoon, P. W. C. Prasad, Nada Alsalami, Tarik A. Rashid",
  "year": 2022,
  "url": "http://arxiv.org/abs/2203.04371v1",
  "abstract": "Background and Aim: Each stage of sleep can affect human health, and not\ngetting enough sleep at any stage may lead to sleep disorder like parasomnia,\napnea, insomnia, etc. Sleep-related diseases could be diagnosed using\nConvolutional Neural Network Classifier. However, this classifier has not been\nsuccessfully implemented into sleep stage classification systems due to high\ncomplexity and low accuracy of classification. The aim of this research is to\nincrease the accuracy and reduce the learning time of Convolutional Neural\nNetwork Classifier. Methodology: The proposed system used a modified Orthogonal\nConvolutional Neural Network and a modified Adam optimisation technique to\nimprove the sleep stage classification accuracy and reduce the gradient\nsaturation problem that occurs due to sigmoid activation function. The proposed\nsystem uses Leaky Rectified Linear Unit (ReLU) instead of sigmoid activation\nfunction as an activation function. Results: The proposed system called\nEnhanced Sleep Stage Classification system (ESSC) used six different databases\nfor training and testing the proposed model on the different sleep stages.\nThese databases are University College Dublin database (UCD), Beth Israel\nDeaconess Medical Center MIT database (MIT-BIH), Sleep European Data Format\n(EDF), Sleep EDF Extended, Montreal Archive of Sleep Studies (MASS), and Sleep\nHeart Health Study (SHHS). Our results show that the gradient saturation\nproblem does not exist anymore. The modified Adam optimiser helps to reduce the\nnoise which in turn result in faster convergence time. Conclusion: The\nconvergence speed of ESSC is increased along with better classification\naccuracy compared to the state of art solution.",
  "citation": 15
}