{
  "title": "SAM Meets Robotic Surgery: An Empirical Study on Generalization,\n  Robustness and Adaptation",
  "authors": "An Wang, Mobarakol Islam, Mengya Xu, Yang Zhang, Hongliang Ren",
  "year": 2023,
  "url": "http://arxiv.org/abs/2308.07156v1",
  "abstract": "The Segment Anything Model (SAM) serves as a fundamental model for semantic\nsegmentation and demonstrates remarkable generalization capabilities across a\nwide range of downstream scenarios. In this empirical study, we examine SAM's\nrobustness and zero-shot generalizability in the field of robotic surgery. We\ncomprehensively explore different scenarios, including prompted and unprompted\nsituations, bounding box and points-based prompt approaches, as well as the\nability to generalize under corruptions and perturbations at five severity\nlevels. Additionally, we compare the performance of SAM with state-of-the-art\nsupervised models. We conduct all the experiments with two well-known robotic\ninstrument segmentation datasets from MICCAI EndoVis 2017 and 2018 challenges.\nOur extensive evaluation results reveal that although SAM shows remarkable\nzero-shot generalization ability with bounding box prompts, it struggles to\nsegment the whole instrument with point-based prompts and unprompted settings.\nFurthermore, our qualitative figures demonstrate that the model either failed\nto predict certain parts of the instrument mask (e.g., jaws, wrist) or\npredicted parts of the instrument as wrong classes in the scenario of\noverlapping instruments within the same bounding box or with the point-based\nprompt. In fact, SAM struggles to identify instruments in complex surgical\nscenarios characterized by the presence of blood, reflection, blur, and shade.\nAdditionally, SAM is insufficiently robust to maintain high performance when\nsubjected to various forms of data corruption. We also attempt to fine-tune SAM\nusing Low-rank Adaptation (LoRA) and propose SurgicalSAM, which shows the\ncapability in class-wise mask prediction without prompt. Therefore, we can\nargue that, without further domain-specific fine-tuning, SAM is not ready for\ndownstream surgical tasks."
}