{
  "title": "DEGAN: Time Series Anomaly Detection using Generative Adversarial\n  Network Discriminators and Density Estimation",
  "authors": "Yueyan Gu, Farrokh Jazizadeh",
  "year": 2022,
  "url": "http://arxiv.org/abs/2210.02449v1",
  "abstract": "Developing efficient time series anomaly detection techniques is important to\nmaintain service quality and provide early alarms. Generative neural network\nmethods are one class of the unsupervised approaches that are achieving\nincreasing attention in recent years. In this paper, we have proposed an\nunsupervised Generative Adversarial Network (GAN)-based anomaly detection\nframework, DEGAN. It relies solely on normal time series data as input to train\na well-configured discriminator (D) into a standalone anomaly predictor. In\nthis framework, time series data is processed by the sliding window method.\nExpected normal patterns in data are leveraged to develop a generator (G)\ncapable of generating normal data patterns. Normal data is also utilized in\nhyperparameter tuning and D model selection steps. Validated D models are then\nextracted and applied to evaluate unseen (testing) time series and identify\npatterns that have anomalous characteristics. Kernel density estimation (KDE)\nis applied to data points that are likely to be anomalous to generate\nprobability density functions on the testing time series. The segments with the\nhighest relative probabilities are detected as anomalies. To evaluate the\nperformance, we tested on univariate acceleration time series for five miles of\na Class I railroad track. We implemented the framework to detect the real\nanomalous observations identified by operators. The results show that\nleveraging the framework with a CNN D architecture results in average best\nrecall and precision of 80% and 86%, respectively, which demonstrates that a\nwell-trained standalone D model has the potential to be a reliable anomaly\ndetector. Moreover, the influence of GAN hyperparameters, GAN architectures,\nsliding window sizes, clustering of time series, and model validation with\nlabeled/unlabeled data were also investigated.",
  "citation": 6
}