{
  "title": "Detecting Multivariate Time Series Anomalies with Zero Known Label",
  "authors": "Qihang Zhou, Jiming Chen, Haoyu Liu, Shibo He, Wenchao Meng",
  "year": 2022,
  "url": "http://arxiv.org/abs/2208.02108v3",
  "abstract": "Multivariate time series anomaly detection has been extensively studied under\nthe semi-supervised setting, where a training dataset with all normal instances\nis required. However, preparing such a dataset is very laborious since each\nsingle data instance should be fully guaranteed to be normal. It is, therefore,\ndesired to explore multivariate time series anomaly detection methods based on\nthe dataset without any label knowledge. In this paper, we propose MTGFlow, an\nunsupervised anomaly detection approach for multivariate time series anomaly\ndetection via dynamic graph and entity-aware normalizing flow, leaning only on\na widely accepted hypothesis that abnormal instances exhibit sparse densities\nthan the normal. However, the complex interdependencies among entities and the\ndiverse inherent characteristics of each entity pose significant challenges on\nthe density estimation, let alone to detect anomalies based on the estimated\npossibility distribution. To tackle these problems, we propose to learn the\nmutual and dynamic relations among entities via a graph structure learning\nmodel, which helps to model accurate distribution of multivariate time series.\nMoreover, taking account of distinct characteristics of the individual\nentities, an entity-aware normalizing flow is developed to describe each entity\ninto a parameterized normal distribution, thereby producing fine-grained\ndensity estimation. Incorporating these two strategies, MTGFlow achieves\nsuperior anomaly detection performance. Experiments on five public datasets\nwith seven baselines are conducted, MTGFlow outperforms the SOTA methods by up\nto 5.0 AUROC\\%. Codes will be released at\nhttps://github.com/zqhang/Detecting-Multivariate-Time-Series-Anomalies-with-Zero-Known-Label.",
  "citation": 52
}