{
  "title": "HFN: Heterogeneous Feature Network for Multivariate Time Series Anomaly\n  Detection",
  "authors": "Jun Zhan, Chengkun Wu, Canqun Yang, Qiucheng Miao, Xiandong Ma",
  "year": 2022,
  "url": "http://arxiv.org/abs/2211.00277v2",
  "abstract": "Network or physical attacks on industrial equipment or computer systems may\ncause massive losses. Therefore, a quick and accurate anomaly detection (AD)\nbased on monitoring data, especially the multivariate time-series (MTS) data,\nis of great significance. As the key step of anomaly detection for MTS data,\nlearning the relations among different variables has been explored by many\napproaches. However, most of the existing approaches do not consider the\nheterogeneity between variables, that is, different types of variables\n(continuous numerical variables, discrete categorical variables or hybrid\nvariables) may have different and distinctive edge distributions. In this\npaper, we propose a novel semi-supervised anomaly detection framework based on\na heterogeneous feature network (HFN) for MTS, learning heterogeneous structure\ninformation from a mass of unlabeled time-series data to improve the accuracy\nof anomaly detection, and using attention coefficient to provide an explanation\nfor the detected anomalies. Specifically, we first combine the embedding\nsimilarity subgraph generated by sensor embedding and feature value similarity\nsubgraph generated by sensor values to construct a time-series heterogeneous\ngraph, which fully utilizes the rich heterogeneous mutual information among\nvariables. Then, a prediction model containing nodes and channel attentions is\njointly optimized to obtain better time-series representations. This approach\nfuses the state-of-the-art technologies of heterogeneous graph structure\nlearning (HGSL) and representation learning. The experiments on four sensor\ndatasets from real-world applications demonstrate that our approach detects the\nanomalies more accurately than those baseline approaches, thus providing a\nbasis for the rapid positioning of anomalies.",
  "citation": 7
}