{
  "title": "VizADS-B: Analyzing Sequences of ADS-B Images Using Explainable\n  Convolutional LSTM Encoder-Decoder to Detect Cyber Attacks",
  "authors": "Sefi Akerman, Edan Habler, Asaf Shabtai",
  "year": 2019,
  "url": "http://arxiv.org/abs/1906.07921v1",
  "abstract": "The purpose of the automatic dependent surveillance broadcast (ADS-B)\ntechnology is to serve as a replacement for the current radar-based, air\ntraffic control systems. Despite the considerable time and resources devoted to\ndesigning and developing the system, the ADS-B is well known for its lack of\nsecurity mechanisms. Attempts to address these security vulnerabilities have\nbeen made in previous studies by modifying the protocol's current architecture\nor by using additional hardware components. These solutions, however, are\nconsidered impractical because of 1) the complex regulatory process involving\navionic systems, 2) the high costs of using hardware components, and 3) the\nfact that the ADS-B system itself is already deployed in most aircraft and\nground stations around the world. In this paper, we propose VizADS-B, an\nalternative software-based security solution for detecting anomalous ADS-B\nmessages, which does not require any alteration of the current ADS-B\narchitecture or the addition of sensors. According to the proposed method, the\ninformation obtained from all aircraft within a specific geographical area is\naggregated and represented as a stream of images. Then, a convolutional LSTM\nencoder-decoder model is used for analyzing and detecting anomalies in the\nsequences of images. In addition, we propose an explainability technique,\ndesigned specifically for convolutional LSTM encoder-decoder models, which is\nused for providing operative information to the pilot as a visual indicator of\na detected anomaly, thus allowing the pilot to make relevant decisions. We\nevaluated our proposed method on five datasets by injecting and subsequently\nidentifying five different attacks. Our experiments demonstrate that most of\nthe attacks can be detected based on spatio-temporal anomaly detection\napproach.",
  "citation": 37
}