{
  "title": "Cuffless Blood Pressure Estimation from Electrocardiogram and\n  Photoplethysmogram Using Waveform Based ANN-LSTM Network",
  "authors": "Md. Sayed Tanveer, Md. Kamrul Hasan",
  "year": 2018,
  "url": "http://arxiv.org/abs/1811.02214v1",
  "abstract": "Goal: Although photoplethysmogram (PPG) and electrocardiogram (ECG) signals\ncan be used to estimate blood pressure (BP) by extracting various features, the\nchanges in morphological contours of both PPG and ECG signals due to various\ndiseases of circulatory system and interaction of other physiological systems\nmake the extraction of such features very difficult. Methods: In this work, we\npropose a waveform-based hierarchical Artificial Neural Network - Long Short\nTerm Memory (ANN-LSTM) model for BP estimation. The model consists of two\nhierarchy levels, where the lower hierarchy level uses ANNs to extract\nnecessary morphological features from ECG and PPG waveforms and the upper\nhierarchy level uses LSTM layers to account for the time domain variation of\nthe features extracted by lower hierarchy level. Results: The proposed model is\nevaluated on 39 subjects using the Association for the Advancement of Medical\nInstrumentations (AAMI) standard and the British Hypertension Society (BHS)\nstandard. The method satisfies both the standards in the estimation of systolic\nblood pressure (SBP) and diastolic blood pressure (DBP). For the proposed\nnetwork, the mean absolute error (MAE) and the root mean square error (RMSE)\nfor SBP estimation are 1.10 and 1.56 mmHg, respectively, and for DBP estimation\nare 0.58 and 0.85 mmHg, respectively. Conclusion: The performance of the\nproposed hierarchical ANN-LSTM model is found to be better than the other\nfeature engineering-based networks. It is shown that the proposed model is able\nto automatically extract the necessary features and their time domain\nvariations to estimate BP reliably in a noninvasive continuous manner.\nSignificance: The method is expected to greatly facilitate the presently\navailable mobile health-care gadgets in continuous BP estimation.",
  "citation": 220
}