{
  "title": "Schrödinger Spectrum based Continuous Cuff-less Blood Pressure\n  Estimation using Clinically Relevant Features from PPG Signal and its Second\n  Derivative",
  "authors": "Aayushman Ghosh, Sayan Sarkar, Jayant Kalra",
  "year": 2023,
  "url": "http://arxiv.org/abs/2301.08439v1",
  "abstract": "The presented study aims to estimate blood pressure (BP) using\nphotoplethysmogram (PPG) signals while employing multiple machine learning\nmodels. The study proposes a novel algorithm for signal reconstruction, which\nutilizes the semi-classical signal analysis (SCSA) technique. The proposed\nalgorithm optimises the semi-classical constant and eliminates the trade-off\nbetween complexity and accuracy in reconstruction. The reconstructed signals'\nspectral features are extracted and incorporated with clinically relevant PPG\nand its second derivative's (SDPPG) morphological features. The developed\nmethod was assessed using a publicly available virtual in-silico dataset with\nmore than 4000 subjects, and the Multi-Parameter Intelligent Monitoring in\nIntensive Care Units dataset. Results showed that the method attained a mean\nabsolute error of 5.37 and 2.96 mmHg for systolic and diastolic BP,\nrespectively, using the CatBoost supervisory algorithm. This approach met the\nstandards set by the Advancement of Medical Instrumentation, and achieved Grade\nA for all BP categories in the British Hypertension Society protocol. The\nproposed framework performs well even when applied to a combined database of\nthe MIMIC-III and the Queensland dataset. This study also evaluates the\nproposed method's performance in a non-clinical setting with noisy and deformed\nPPG signals, to validate the efficacy of the SCSA method. The noise stress\ntests showed that the algorithm maintained its key feature detection, signal\nreconstruction capability, and estimation accuracy up to a 10 dB SNR ratio. It\nis believed that the proposed cuff-less BP estimation technique has the\npotential to perform well on resource-constrained settings due to its\nstraightforward implementation approach.",
  "citation": 16
}