{
  "title": "SurgPETL: Parameter-Efficient Image-to-Surgical-Video Transfer Learning\n  for Surgical Phase Recognition",
  "authors": "Shu Yang, Zhiyuan Cai, Luyang Luo, Ning Ma, Shuchang Xu, Hao Chen",
  "year": 2024,
  "url": "http://arxiv.org/abs/2409.20083v1",
  "abstract": "Capitalizing on image-level pre-trained models for various downstream tasks\nhas recently emerged with promising performance. However, the paradigm of\n\"image pre-training followed by video fine-tuning\" for high-dimensional video\ndata inevitably poses significant performance bottlenecks. Furthermore, in the\nmedical domain, many surgical video tasks encounter additional challenges posed\nby the limited availability of video data and the necessity for comprehensive\nspatial-temporal modeling. Recently, Parameter-Efficient Image-to-Video\nTransfer Learning has emerged as an efficient and effective paradigm for video\naction recognition tasks, which employs image-level pre-trained models with\npromising feature transferability and involves cross-modality temporal modeling\nwith minimal fine-tuning. Nevertheless, the effectiveness and generalizability\nof this paradigm within intricate surgical domain remain unexplored. In this\npaper, we delve into a novel problem of efficiently adapting image-level\npre-trained models to specialize in fine-grained surgical phase recognition,\ntermed as Parameter-Efficient Image-to-Surgical-Video Transfer Learning.\nFirstly, we develop a parameter-efficient transfer learning benchmark SurgPETL\nfor surgical phase recognition, and conduct extensive experiments with three\nadvanced methods based on ViTs of two distinct scales pre-trained on five\nlarge-scale natural and medical datasets. Then, we introduce the\nSpatial-Temporal Adaptation module, integrating a standard spatial adapter with\na novel temporal adapter to capture detailed spatial features and establish\nconnections across temporal sequences for robust spatial-temporal modeling.\nExtensive experiments on three challenging datasets spanning various surgical\nprocedures demonstrate the effectiveness of SurgPETL with STA."
}