{
  "title": "SWAG: Long-term Surgical Workflow Prediction with Generative-based\n  Anticipation",
  "authors": "Maxence Boels, Yang Liu, Prokar Dasgupta, Alejandro Granados, Sebastien Ourselin",
  "year": 2024,
  "url": "http://arxiv.org/abs/2412.18849v4",
  "abstract": "While existing approaches excel at recognising current surgical phases, they\nprovide limited foresight and intraoperative guidance into future procedural\nsteps. Similarly, current anticipation methods are constrained to predicting\nshort-term and single events, neglecting the dense, repetitive, and long\nsequential nature of surgical workflows. To address these needs and\nlimitations, we propose SWAG (Surgical Workflow Anticipative Generation), a\nframework that combines phase recognition and anticipation using a generative\napproach. This paper investigates two distinct decoding methods - single-pass\n(SP) and auto-regressive (AR) - to generate sequences of future surgical phases\nat minute intervals over long horizons. We propose a novel embedding approach\nusing class transition probabilities to enhance the accuracy of phase\nanticipation. Additionally, we propose a generative framework using remaining\ntime regression to classification (R2C). SWAG was evaluated on two publicly\navailable datasets, Cholec80 and AutoLaparo21. Our single-pass model with class\ntransition probability embeddings (SP*) achieves 32.1% and 41.3% F1 scores over\n20 and 30 minutes on Cholec80 and AutoLaparo21, respectively. Moreover, our\napproach competes with existing methods on phase remaining time regression,\nachieving weighted mean absolute errors of 0.32 and 0.48 minutes for 2- and\n3-minute horizons. SWAG demonstrates versatility across generative decoding\nframe works and classification and regression tasks to create temporal\ncontinuity between surgical workflow recognition and anticipation. Our method\nprovides steps towards intraoperative surgical workflow generation for\nanticipation. Project: https://maxboels.com/research/swag."
}