{
  "title": "Less is More: Surgical Phase Recognition from Timestamp Supervision",
  "authors": "Xinpeng Ding, Xinjian Yan, Zixun Wang, Wei Zhao, Jian Zhuang, Xiaowei Xu, Xiaomeng Li",
  "year": 2022,
  "url": "http://arxiv.org/abs/2202.08199v2",
  "abstract": "Surgical phase recognition is a fundamental task in computer-assisted surgery\nsystems. Most existing works are under the supervision of expensive and\ntime-consuming full annotations, which require the surgeons to repeat watching\nvideos to find the precise start and end time for a surgical phase. In this\npaper, we introduce timestamp supervision for surgical phase recognition to\ntrain the models with timestamp annotations, where the surgeons are asked to\nidentify only a single timestamp within the temporal boundary of a phase. This\nannotation can significantly reduce the manual annotation cost compared to the\nfull annotations. To make full use of such timestamp supervisions, we propose a\nnovel method called uncertainty-aware temporal diffusion (UATD) to generate\ntrustworthy pseudo labels for training. Our proposed UATD is motivated by the\nproperty of surgical videos, i.e., the phases are long events consisting of\nconsecutive frames. To be specific, UATD diffuses the single labelled timestamp\nto its corresponding high confident ( i.e., low uncertainty) neighbour frames\nin an iterative way. Our study uncovers unique insights of surgical phase\nrecognition with timestamp supervisions: 1) timestamp annotation can reduce 74%\nannotation time compared with the full annotation, and surgeons tend to\nannotate those timestamps near the middle of phases; 2) extensive experiments\ndemonstrate that our method can achieve competitive results compared with full\nsupervision methods, while reducing manual annotation cost; 3) less is more in\nsurgical phase recognition, i.e., less but discriminative pseudo labels\noutperform full but containing ambiguous frames; 4) the proposed UATD can be\nused as a plug and play method to clean ambiguous labels near boundaries\nbetween phases, and improve the performance of the current surgical phase\nrecognition methods."
}