{
  "title": "SuPRA: Surgical Phase Recognition and Anticipation for Intra-Operative\n  Planning",
  "authors": "Maxence Boels, Yang Liu, Prokar Dasgupta, Alejandro Granados, Sebastien Ourselin",
  "year": 2024,
  "url": "http://arxiv.org/abs/2403.06200v1",
  "abstract": "Intra-operative recognition of surgical phases holds significant potential\nfor enhancing real-time contextual awareness in the operating room. However, we\nargue that online recognition, while beneficial, primarily lends itself to\npost-operative video analysis due to its limited direct impact on the actual\nsurgical decisions and actions during ongoing procedures. In contrast, we\ncontend that the prediction and anticipation of surgical phases are inherently\nmore valuable for intra-operative assistance, as they can meaningfully\ninfluence a surgeon's immediate and long-term planning by providing foresight\ninto future steps. To address this gap, we propose a dual approach that\nsimultaneously recognises the current surgical phase and predicts upcoming\nones, thus offering comprehensive intra-operative assistance and guidance on\nthe expected remaining workflow. Our novel method, Surgical Phase Recognition\nand Anticipation (SuPRA), leverages past and current information for accurate\nintra-operative phase recognition while using future segments for phase\nprediction. This unified approach challenges conventional frameworks that treat\nthese objectives separately. We have validated SuPRA on two reputed datasets,\nCholec80 and AutoLaparo21, where it demonstrated state-of-the-art performance\nwith recognition accuracies of 91.8% and 79.3%, respectively. Additionally, we\nintroduce and evaluate our model using new segment-level evaluation metrics,\nnamely Edit and F1 Overlap scores, for a more temporal assessment of segment\nclassification. In conclusion, SuPRA presents a new multi-task approach that\npaves the way for improved intra-operative assistance through surgical phase\nrecognition and prediction of future events."
}