{
  "title": "BP-Net: Cuff-less, Calibration-free, and Non-invasive Blood Pressure\n  Estimation via a Generic Deep Convolutional Architecture",
  "authors": "Soheil Zabihi, Elahe Rahimian, Fatemeh Marefat, Amir Asif, Pedram Mohseni, Arash Mohammadi",
  "year": 2021,
  "url": "http://arxiv.org/abs/2112.15271v1",
  "abstract": "Objective: The paper focuses on development of robust and accurate processing\nsolutions for continuous and cuff-less blood pressure (BP) monitoring. In this\nregard, a robust deep learning-based framework is proposed for computation of\nlow latency, continuous, and calibration-free upper and lower bounds on the\nsystolic and diastolic BP. Method: Referred to as the BP-Net, the proposed\nframework is a novel convolutional architecture that provides longer effective\nmemory while achieving superior performance due to incorporation of casual\ndialated convolutions and residual connections. To utilize the real potential\nof deep learning in extraction of intrinsic features (deep features) and\nenhance the long-term robustness, the BP-Net uses raw Electrocardiograph (ECG)\nand Photoplethysmograph (PPG) signals without extraction of any form of\nhand-crafted features as it is common in existing solutions. Results: By\ncapitalizing on the fact that datasets used in recent literature are not\nunified and properly defined, a benchmark dataset is constructed from the\nMIMIC-I and MIMIC-III databases obtained from PhysioNet. The proposed BP-Net is\nevaluated based on this benchmark dataset demonstrating promising performance\nand shows superior generalizable capacity. Conclusion: The proposed BP-Net\narchitecture is more accurate than canonical recurrent networks and enhances\nthe long-term robustness of the BP estimation task. Significance: The proposed\nBP-Net architecture addresses key drawbacks of existing BP estimation\nsolutions, i.e., relying heavily on extraction of hand-crafted features, such\nas pulse arrival time (PAT), and; Lack of robustness. Finally, the constructed\nBP-Net dataset provides a unified base for evaluation and comparison of deep\nlearning-based BP estimation algorithms.",
  "citation": 2
}