{
  "title": "Exploring the limitations of blood pressure estimation using the\n  photoplethysmography signal",
  "authors": "Felipe M. Dias, Diego A. C. Cardenas, Marcelo A. F. Toledo, Filipe A. C. Oliveira, Estela Ribeiro, Jose E. Krieger, Marco A. Gutierrez",
  "year": 2024,
  "url": "http://arxiv.org/abs/2404.16049v1",
  "abstract": "Hypertension, a leading contributor to cardiovascular morbidity, underscores\nthe need for accurate and continuous blood pressure (BP) monitoring.\nPhotoplethysmography (PPG) presents a promising approach to this end. However,\nthe precision of BP estimates derived from PPG signals has been the subject of\nongoing debate, necessitating a comprehensive evaluation of their effectiveness\nand constraints. We developed a calibration-based Siamese ResNet model for BP\nestimation, using a signal input paired with a reference BP reading. We\ncompared the use of normalized PPG (N-PPG) against the normalized Invasive\nArterial Blood Pressure (N-IABP) signals as input. The N-IABP signals do not\ndirectly present systolic and diastolic values but theoretically provide a more\naccurate BP measure than PPG signals since it is a direct pressure sensor\ninside the body. Our strategy establishes a critical benchmark for PPG\nperformance, realistically calibrating expectations for PPG's BP estimation\ncapabilities. Nonetheless, we compared the performance of our models using\ndifferent signal-filtering conditions to evaluate the impact of filtering on\nthe results. We evaluated our method using the AAMI and the BHS standards\nemploying the VitalDB dataset. The N-IABP signals meet with AAMI standards for\nboth Systolic Blood Pressure (SBP) and Diastolic Blood Pressure (DBP), with\nerrors of 1.29+-6.33mmHg for systolic pressure and 1.17+-5.78mmHg for systolic\nand diastolic pressure respectively for the raw N-IABP signal. In contrast,\nN-PPG signals, in their best setup, exhibited inferior performance than N-IABP,\npresenting 1.49+-11.82mmHg and 0.89+-7.27mmHg for systolic and diastolic\npressure respectively. Our findings highlight the potential and limitations of\nemploying PPG for BP estimation, showing that these signals contain information\ncorrelated to BP but may not be sufficient for predicting it accurately.",
  "citation": 5
}