{
  "title": "TransfoRhythm: A Transformer Architecture Conductive to Blood Pressure\n  Estimation via Solo PPG Signal Capturing",
  "authors": "Amir Arjomand, Amin Boudesh, Farnoush Bayatmakou, Kenneth B. Kent, Arash Mohammadi",
  "year": 2024,
  "url": "http://arxiv.org/abs/2404.15352v2",
  "abstract": "Recent statistics indicate that approximately 1.3 billion individuals\nworldwide suffer from hypertension, a leading cause of premature death\nglobally. Blood Pressure (BP) serves as a critical health indicator for\naccurate and timely diagnosis and/or treatment of hypertension. Traditional BP\nmeasurement methods rely on cuff-based approaches, which lack real-time,\ncontinuous, and reliable BP estimates, crucial for the timely\ndiagnosis/treatment of hypertension. Driven by recent advancements in\nArtificial Intelligence (AI) and Deep Neural Networks (DNNs), there has been a\nsurge of interest in developing data-driven and cuff-less BP estimation\nsolutions. In this context, current literature predominantly focuses on\ncoupling Electrocardiography (ECG) and Photoplethysmography (PPG) sensors,\nthough this approach is constrained by reliance on multiple sensor types. An\nalternative, utilizing standalone PPG signals, presents challenges due to the\nabsence of auxiliary sensors (ECG), requiring the use of morphological features\nwhile addressing motion artifacts and high-frequency noise. To address these\nissues, the paper introduces the TransfoRhythm framework, a Transformer-based\nDNN architecture built upon the recently released physiological database,\nMIMIC-IV. Leveraging the Multi-Head Attention (MHA) mechanism, TransfoRhythm\nidentifies dependencies and similarities across data segments, forming a robust\nframework for cuff-less BP estimation solely using PPG signals. To our\nknowledge, this paper represents the first study to apply the MIMIC IV dataset\nfor cuff-less BP estimation. TransfoRhythm achieves highly accurate results\nwith a Root Mean Square Error (RMSE) of [2.21, 1.84] and a Mean Absolute Error\n(MAE) of [1.37, 1.06] for systolic and diastolic blood pressures, respectively.",
  "citation": 3
}