{
  "title": "A Practitioner's Guide to Quantum Algorithms for Optimisation Problems",
  "authors": "Benjamin C. B. Symons, David Galvin, Emre Sahin, Vassil Alexandrov, Stefano Mensa",
  "year": 2023,
  "url": "http://arxiv.org/abs/2305.07323v1",
  "abstract": "Quantum computing is gaining popularity across a wide range of scientific\ndisciplines due to its potential to solve long-standing computational problems\nthat are considered intractable with classical computers. One promising area\nwhere quantum computing has potential is in the speed-up of NP-hard\noptimisation problems that are common in industrial areas such as logistics and\nfinance. Newcomers to the field of quantum computing who are interested in\nusing this technology to solve optimisation problems do not have an easily\naccessible source of information on the current capabilities of quantum\ncomputers and algorithms. This paper aims to provide a comprehensive overview\nof the theory of quantum optimisation techniques and their practical\napplication, focusing on their near-term potential for noisy intermediate scale\nquantum devices. Two main paradigms for quantum hardware are then discussed:\nquantum annealing and gate-based quantum computing. While quantum annealers are\neffective for some optimisation problems, they have limitations and cannot be\nused for universal quantum computation. In contrast, gate-based quantum\ncomputers offer the potential for universal quantum computation, but they face\nchallenges with hardware limitations and accurate gate implementation. The\npaper provides a detailed mathematical discussion with references to key works\nin the field, as well as a more practical discussion with relevant examples.\nThe most popular techniques for quantum optimisation on gate-based quantum\ncomputers, the quantum approximate optimisation (QAO) algorithm and the quantum\nalternating operator ansatz (QAOA) framework, are discussed in detail. The\npaper concludes with a discussion of the challenges facing quantum optimisation\ntechniques and the need for further research and development to identify new,\neffective methods for achieving quantum advantage."
}