{
  "title": "Non-Abelian Anyons and Topological Quantum Computation",
  "authors": "Chetan Nayak, Steven H. Simon, Ady Stern, Michael Freedman, Sankar Das Sarma",
  "year": 2007,
  "url": "http://arxiv.org/abs/0707.1889v2",
  "abstract": "Topological quantum computation has recently emerged as one of the most\nexciting approaches to constructing a fault-tolerant quantum computer. The\nproposal relies on the existence of topological states of matter whose\nquasiparticle excitations are neither bosons nor fermions, but are particles\nknown as {\\it Non-Abelian anyons}, meaning that they obey {\\it non-Abelian\nbraiding statistics}. Quantum information is stored in states with multiple\nquasiparticles, which have a topological degeneracy. The unitary gate\noperations which are necessary for quantum computation are carried out by\nbraiding quasiparticles, and then measuring the multi-quasiparticle states. The\nfault-tolerance of a topological quantum computer arises from the non-local\nencoding of the states of the quasiparticles, which makes them immune to errors\ncaused by local perturbations. To date, the only such topological states\nthought to have been found in nature are fractional quantum Hall states, most\nprominently the \\nu=5/2 state, although several other prospective candidates\nhave been proposed in systems as disparate as ultra-cold atoms in optical\nlattices and thin film superconductors. In this review article, we describe\ncurrent research in this field, focusing on the general theoretical concepts of\nnon-Abelian statistics as it relates to topological quantum computation, on\nunderstanding non-Abelian quantum Hall states, on proposed experiments to\ndetect non-Abelian anyons, and on proposed architectures for a topological\nquantum computer. We address both the mathematical underpinnings of topological\nquantum computation and the physics of the subject using the \\nu=5/2 fractional\nquantum Hall state as the archetype of a non-Abelian topological state enabling\nfault-tolerant quantum computation."
}