{
  "title": "GAN for Vision, KG for Relation: a Two-stage Deep Network for Zero-shot\n  Action Recognition",
  "authors": "Bin Sun, Dehui Kong, Shaofan Wang, Jinghua Li, Baocai Yin, Xiaonan Luo",
  "year": 2021,
  "url": "http://arxiv.org/abs/2105.11789v1",
  "abstract": "Zero-shot action recognition can recognize samples of unseen classes that are\nunavailable in training by exploring common latent semantic representation in\nsamples. However, most methods neglected the connotative relation and\nextensional relation between the action classes, which leads to the poor\ngeneralization ability of the zero-shot learning. Furthermore, the learned\nclassifier incline to predict the samples of seen class, which leads to poor\nclassification performance. To solve the above problems, we propose a two-stage\ndeep neural network for zero-shot action recognition, which consists of a\nfeature generation sub-network serving as the sampling stage and a graph\nattention sub-network serving as the classification stage. In the sampling\nstage, we utilize a generative adversarial networks (GAN) trained by action\nfeatures and word vectors of seen classes to synthesize the action features of\nunseen classes, which can balance the training sample data of seen classes and\nunseen classes. In the classification stage, we construct a knowledge graph\n(KG) based on the relationship between word vectors of action classes and\nrelated objects, and propose a graph convolution network (GCN) based on\nattention mechanism, which dynamically updates the relationship between action\nclasses and objects, and enhances the generalization ability of zero-shot\nlearning. In both stages, we all use word vectors as bridges for feature\ngeneration and classifier generalization from seen classes to unseen classes.\nWe compare our method with state-of-the-art methods on UCF101 and HMDB51\ndatasets. Experimental results show that our proposed method improves the\nclassification performance of the trained classifier and achieves higher\naccuracy.",
  "citation": 21
}