{
  "url": "http://arxiv.org/abs/2503.19308v1",
  "title": "A Comprehensive Analysis of Mamba for 3D Volumetric Medical Image\n  Segmentation",
  "authors": "Chaohan Wang, Yutong Xie, Qi Chen, Yuyin Zhou, Qi Wu",
  "year": 2025,
  "abstract": "Mamba, with its selective State Space Models (SSMs), offers a more\ncomputationally efficient solution than Transformers for long-range dependency\nmodeling. However, there is still a debate about its effectiveness in\nhigh-resolution 3D medical image segmentation. In this study, we present a\ncomprehensive investigation into Mamba's capabilities in 3D medical image\nsegmentation by tackling three pivotal questions: Can Mamba replace\nTransformers? Can it elevate multi-scale representation learning? Is complex\nscanning necessary to unlock its full potential? We evaluate Mamba's\nperformance across three large public benchmarks-AMOS, TotalSegmentator, and\nBraTS. Our findings reveal that UlikeMamba, a U-shape Mamba-based network,\nconsistently surpasses UlikeTrans, a U-shape Transformer-based network,\nparticularly when enhanced with custom-designed 3D depthwise convolutions,\nboosting accuracy and computational efficiency. Further, our proposed\nmulti-scale Mamba block demonstrates superior performance in capturing both\nfine-grained details and global context, especially in complex segmentation\ntasks, surpassing Transformer-based counterparts. We also critically assess\ncomplex scanning strategies, finding that simpler methods often suffice, while\nour Tri-scan approach delivers notable advantages in the most challenging\nscenarios. By integrating these advancements, we introduce a new network for 3D\nmedical image segmentation, positioning Mamba as a transformative force that\noutperforms leading models such as nnUNet, CoTr, and U-Mamba, offering\ncompetitive accuracy with superior computational efficiency. This study\nprovides key insights into Mamba's unique advantages, paving the way for more\nefficient and accurate approaches to 3D medical imaging."
}