{
  "title": "Mamba time series forecasting with uncertainty quantification",
  "authors": "Pedro Pessoa, Paul Campitelli, Douglas P. Shepherd, S. Banu Ozkan, Steve Pressé",
  "year": 2025,
  "url": "http://arxiv.org/abs/2503.10873v2",
  "abstract": "State space models, such as Mamba, have recently garnered attention in time\nseries forecasting due to their ability to capture sequence patterns. However,\nin electricity consumption benchmarks, Mamba forecasts exhibit a mean error of\napproximately 8\\%. Similarly, in traffic occupancy benchmarks, the mean error\nreaches 18\\%. This discrepancy leaves us to wonder whether the prediction is\nsimply inaccurate or falls within error given spread in historical data. To\naddress this limitation, we propose a method to quantify the predictive\nuncertainty of Mamba forecasts. Here, we propose a dual-network framework based\non the Mamba architecture for probabilistic forecasting, where one network\ngenerates point forecasts while the other estimates predictive uncertainty by\nmodeling variance. We abbreviate our tool, Mamba with probabilistic time series\nforecasting, as Mamba-ProbTSF and the code for its implementation is available\non GitHub (https://github.com/PessoaP/Mamba-ProbTSF). Evaluating this approach\non synthetic and real-world benchmark datasets, we find Kullback-Leibler\ndivergence between the learned distributions and the data--which, in the limit\nof infinite data, should converge to zero if the model correctly captures the\nunderlying probability distribution--reduced to the order of $10^{-3}$ for\nsynthetic data and $10^{-1}$ for real-world benchmark, demonstrating its\neffectiveness. We find that in both the electricity consumption and traffic\noccupancy benchmark, the true trajectory stays within the predicted uncertainty\ninterval at the two-sigma level about 95\\% of the time. We end with a\nconsideration of potential limitations, adjustments to improve performance, and\nconsiderations for applying this framework to processes for purely or largely\nstochastic dynamics where the stochastic changes accumulate, as observed for\nexample in pure Brownian motion or molecular dynamics trajectories."
}