{
  "title": "MSFMamba: Multi-Scale Feature Fusion State Space Model for Multi-Source\n  Remote Sensing Image Classification",
  "authors": "Feng Gao, Xuepeng Jin, Xiaowei Zhou, Junyu Dong, Qian Du",
  "year": 2024,
  "url": "http://arxiv.org/abs/2408.14255v2",
  "abstract": "In the field of multi-source remote sensing image classification, remarkable\nprogress has been made by using Convolutional Neural Network (CNN) and\nTransformer. Recently, Mamba-based methods built upon the State Space Model\n(SSM) have shown great potential for long-range dependency modeling with linear\ncomplexity, but they have rarely been explored for multi-source remote sensing\nimage classification tasks. To address this issue, we propose the Multi-Scale\nFeature Fusion Mamba (MSFMamba) network, a novel framework designed for the\njoint classification of hyperspectral image (HSI) and Light Detection and\nRanging (LiDAR)/Synthetic Aperture Radar (SAR) data. The MSFMamba network is\ncomposed of three key components: the Multi-Scale Spatial Mamba (MSpa-Mamba)\nblock, the Spectral Mamba (Spe-Mamba) block, and the Fusion Mamba (Fus-Mamba)\nblock. The MSpa-Mamba block employs a multi-scale strategy to reduce\ncomputational cost and alleviate feature redundancy in multiple scanning\nroutes, ensuring efficient spatial feature modeling. The Spe-Mamba block\nfocuses on spectral feature extraction, addressing the unique challenges of HSI\ndata representation. Finally, the Fus-Mamba block bridges the heterogeneous gap\nbetween HSI and LiDAR/SAR data by extending the original Mamba architecture to\naccommodate dual inputs, enhancing cross-modal feature interactions and\nenabling seamless data fusion. Together, these components enable MSFMamba to\neffectively tackle the challenges of multi-source data classification,\ndelivering improved performance with optimized computational efficiency.\nComprehensive experiments on four real-world multi-source remote sensing\ndatasets demonstrate the superiority of MSFMamba outperforms several\nstate-of-the-art methods. The source codes of MSFMamba are publicly available\nat https://github.com/oucailab/MSFMamba."
}