{
  "title": "MedSegMamba: 3D CNN-Mamba Hybrid Architecture for Brain Segmentation",
  "authors": "Aaron Cao, Zongyu Li, Jordan Jomsky, Andrew F. Laine, Jia Guo",
  "year": 2024,
  "url": "http://arxiv.org/abs/2409.08307v3",
  "abstract": "Widely used traditional pipelines for subcortical brain segmentation are\noften inefficient and slow, particularly when processing large datasets.\nFurthermore, deep learning models face challenges due to the high resolution of\nMRI images and the large number of anatomical classes involved. To address\nthese limitations, we developed a 3D patch-based hybrid CNN-Mamba model that\nleverages Mamba's selective scan algorithm, thereby enhancing segmentation\naccuracy and efficiency for 3D inputs. This retrospective study utilized 1784\nT1-weighted MRI scans from a diverse, multi-site dataset of healthy\nindividuals. The dataset was divided into training, validation, and testing\nsets with a 1076/345/363 split. The scans were obtained from 1.5T and 3T MRI\nmachines. Our model's performance was validated against several benchmarks,\nincluding other CNN-Mamba, CNN-Transformer, and pure CNN networks, using\nFreeSurfer-generated ground truths. We employed the Dice Similarity Coefficient\n(DSC), Volume Similarity (VS), and Average Symmetric Surface Distance (ASSD) as\nevaluation metrics. Statistical significance was determined using the Wilcoxon\nsigned-rank test with a threshold of P < 0.05. The proposed model achieved the\nhighest overall performance across all metrics (DSC 0.88383; VS 0.97076; ASSD\n0.33604), significantly outperforming all non-Mamba-based models (P < 0.001).\nWhile the model did not show significant improvement in DSC or VS compared to\nanother Mamba-based model (P-values of 0.114 and 0.425), it demonstrated a\nsignificant enhancement in ASSD (P < 0.001) with approximately 20% fewer\nparameters. In conclusion, our proposed hybrid CNN-Mamba architecture offers an\nefficient and accurate approach for 3D subcortical brain segmentation,\ndemonstrating potential advantages over existing methods. Code is available at:\nhttps://github.com/aaroncao06/MedSegMamba."
}