{
  "title": "DualMamba: A Lightweight Spectral-Spatial Mamba-Convolution Network for\n  Hyperspectral Image Classification",
  "authors": "Jiamu Sheng, Jingyi Zhou, Jiong Wang, Peng Ye, Jiayuan Fan",
  "year": 2024,
  "url": "http://arxiv.org/abs/2406.07050v1",
  "abstract": "The effectiveness and efficiency of modeling complex spectral-spatial\nrelations are both crucial for Hyperspectral image (HSI) classification. Most\nexisting methods based on CNNs and transformers still suffer from heavy\ncomputational burdens and have room for improvement in capturing the\nglobal-local spectral-spatial feature representation. To this end, we propose a\nnovel lightweight parallel design called lightweight dual-stream\nMamba-convolution network (DualMamba) for HSI classification. Specifically, a\nparallel lightweight Mamba and CNN block are first developed to extract global\nand local spectral-spatial features. First, the cross-attention\nspectral-spatial Mamba module is proposed to leverage the global modeling of\nMamba at linear complexity. Within this module, dynamic positional embedding is\ndesigned to enhance the spatial location information of visual sequences. The\nlightweight spectral/spatial Mamba blocks comprise an efficient scanning\nstrategy and a lightweight Mamba design to efficiently extract global\nspectral-spatial features. And the cross-attention spectral-spatial fusion is\ndesigned to learn cross-correlation and fuse spectral-spatial features. Second,\nthe lightweight spectral-spatial residual convolution module is proposed with\nlightweight spectral and spatial branches to extract local spectral-spatial\nfeatures through residual learning. Finally, the adaptive global-local fusion\nis proposed to dynamically combine global Mamba features and local convolution\nfeatures for a global-local spectral-spatial representation. Compared with\nstate-of-the-art HSI classification methods, experimental results demonstrate\nthat DualMamba achieves significant classification accuracy on three public HSI\ndatasets and a superior reduction in model parameters and floating point\noperations (FLOPs)."
}