{
  "title": "UD-Mamba: A pixel-level uncertainty-driven Mamba model for medical image\n  segmentation",
  "authors": "Weiren Zhao, Feng Wang, Yanran Wang, Yutong Xie, Qi Wu, Yuyin Zhou",
  "year": 2025,
  "url": "http://arxiv.org/abs/2502.02024v1",
  "abstract": "Recent advancements have highlighted the Mamba framework, a state-space model\nknown for its efficiency in capturing long-range dependencies with linear\ncomputational complexity. While Mamba has shown competitive performance in\nmedical image segmentation, it encounters difficulties in modeling local\nfeatures due to the sporadic nature of traditional location-based scanning\nmethods and the complex, ambiguous boundaries often present in medical images.\nTo overcome these challenges, we propose Uncertainty-Driven Mamba (UD-Mamba),\nwhich redefines the pixel-order scanning process by incorporating channel\nuncertainty into the scanning mechanism. UD-Mamba introduces two key scanning\ntechniques: 1) sequential scanning, which prioritizes regions with high\nuncertainty by scanning in a row-by-row fashion, and 2) skip scanning, which\nprocesses columns vertically, moving from high-to-low or low-to-high\nuncertainty at fixed intervals. Sequential scanning efficiently clusters\nhigh-uncertainty regions, such as boundaries and foreground objects, to improve\nsegmentation precision, while skip scanning enhances the interaction between\nbackground and foreground regions, allowing for timely integration of\nbackground information to support more accurate foreground inference.\nRecognizing the advantages of scanning from certain to uncertain areas, we\nintroduce four learnable parameters to balance the importance of features\nextracted from different scanning methods. Additionally, a cosine consistency\nloss is employed to mitigate the drawbacks of transitioning between uncertain\nand certain regions during the scanning process. Our method demonstrates robust\nsegmentation performance, validated across three distinct medical imaging\ndatasets involving pathology, dermatological lesions, and cardiac tasks."
}