{
  "url": "http://arxiv.org/abs/2310.13039v1",
  "title": "Human Pose-based Estimation, Tracking and Action Recognition with Deep\n  Learning: A Survey",
  "authors": "Lijuan Zhou, Xiang Meng, Zhihuan Liu, Mengqi Wu, Zhimin Gao, Pichao Wang",
  "year": 2023,
  "abstract": "Human pose analysis has garnered significant attention within both the\nresearch community and practical applications, owing to its expanding array of\nuses, including gaming, video surveillance, sports performance analysis, and\nhuman-computer interactions, among others. The advent of deep learning has\nsignificantly improved the accuracy of pose capture, making pose-based\napplications increasingly practical. This paper presents a comprehensive survey\nof pose-based applications utilizing deep learning, encompassing pose\nestimation, pose tracking, and action recognition.Pose estimation involves the\ndetermination of human joint positions from images or image sequences. Pose\ntracking is an emerging research direction aimed at generating consistent human\npose trajectories over time. Action recognition, on the other hand, targets the\nidentification of action types using pose estimation or tracking data. These\nthree tasks are intricately interconnected, with the latter often reliant on\nthe former. In this survey, we comprehensively review related works, spanning\nfrom single-person pose estimation to multi-person pose estimation, from 2D\npose estimation to 3D pose estimation, from single image to video, from mining\ntemporal context gradually to pose tracking, and lastly from tracking to\npose-based action recognition. As a survey centered on the application of deep\nlearning to pose analysis, we explicitly discuss both the strengths and\nlimitations of existing techniques. Notably, we emphasize methodologies for\nintegrating these three tasks into a unified framework within video sequences.\nAdditionally, we explore the challenges involved and outline potential\ndirections for future research."
}