{
  "title": "A Survey on Trustworthiness in Foundation Models for Medical Image\n  Analysis",
  "authors": "Congzhen Shi, Ryan Rezai, Jiaxi Yang, Qi Dou, Xiaoxiao Li",
  "year": 2024,
  "url": "http://arxiv.org/abs/2407.15851v2",
  "abstract": "The rapid advancement of foundation models in medical imaging represents a\nsignificant leap toward enhancing diagnostic accuracy and personalized\ntreatment. However, the deployment of foundation models in healthcare\nnecessitates a rigorous examination of their trustworthiness, encompassing\nprivacy, robustness, reliability, explainability, and fairness. The current\nbody of survey literature on foundation models in medical imaging reveals\nconsiderable gaps, particularly in the area of trustworthiness. Additionally,\nexisting surveys on the trustworthiness of foundation models do not adequately\naddress their specific variations and applications within the medical imaging\ndomain. This survey aims to fill that gap by presenting a novel taxonomy of\nfoundation models used in medical imaging and analyzing the key motivations for\nensuring their trustworthiness. We review current research on foundation models\nin major medical imaging applications, focusing on segmentation, medical report\ngeneration, medical question and answering (Q\\&A), and disease diagnosis. These\nareas are highlighted because they have seen a relatively mature and\nsubstantial number of foundation models compared to other applications. We\nfocus on literature that discusses trustworthiness in medical image analysis\nmanuscripts. We explore the complex challenges of building trustworthy\nfoundation models for each application, summarizing current concerns and\nstrategies for enhancing trustworthiness. Furthermore, we examine the potential\nof these models to revolutionize patient care. Our analysis underscores the\nimperative for advancing towards trustworthy AI in medical image analysis,\nadvocating for a balanced approach that fosters innovation while ensuring\nethical and equitable healthcare delivery."
}