{
  "title": "Augmenting Efficient Real-time Surgical Instrument Segmentation in Video\n  with Point Tracking and Segment Anything",
  "authors": "Zijian Wu, Adam Schmidt, Peter Kazanzides, Septimiu E. Salcudean",
  "year": 2024,
  "url": "http://arxiv.org/abs/2403.08003v2",
  "abstract": "The Segment Anything Model (SAM) is a powerful vision foundation model that\nis revolutionizing the traditional paradigm of segmentation. Despite this, a\nreliance on prompting each frame and large computational cost limit its usage\nin robotically assisted surgery. Applications, such as augmented reality\nguidance, require little user intervention along with efficient inference to be\nusable clinically. In this study, we address these limitations by adopting\nlightweight SAM variants to meet the efficiency requirement and employing\nfine-tuning techniques to enhance their generalization in surgical scenes.\nRecent advancements in Tracking Any Point (TAP) have shown promising results in\nboth accuracy and efficiency, particularly when points are occluded or leave\nthe field of view. Inspired by this progress, we present a novel framework that\ncombines an online point tracker with a lightweight SAM model that is\nfine-tuned for surgical instrument segmentation. Sparse points within the\nregion of interest are tracked and used to prompt SAM throughout the video\nsequence, providing temporal consistency. The quantitative results surpass the\nstate-of-the-art semi-supervised video object segmentation method XMem on the\nEndoVis 2015 dataset with 84.8 IoU and 91.0 Dice. Our method achieves promising\nperformance that is comparable to XMem and transformer-based fully supervised\nsegmentation methods on ex vivo UCL dVRK and in vivo CholecSeg8k datasets. In\naddition, the proposed method shows promising zero-shot generalization ability\non the label-free STIR dataset. In terms of efficiency, we tested our method on\na single GeForce RTX 4060/4090 GPU respectively, achieving an over 25/90 FPS\ninference speed. Code is available at:\nhttps://github.com/wuzijian1997/SIS-PT-SAM"
}