{
  "title": "From Generalization to Precision: Exploring SAM for Tool Segmentation in\n  Surgical Environments",
  "authors": "Kanyifeechukwu J. Oguine, Roger D. Soberanis-Mukul, Nathan Drenkow, Mathias Unberath",
  "year": 2024,
  "url": "http://arxiv.org/abs/2402.17972v1",
  "abstract": "Purpose: Accurate tool segmentation is essential in computer-aided\nprocedures. However, this task conveys challenges due to artifacts' presence\nand the limited training data in medical scenarios. Methods that generalize to\nunseen data represent an interesting venue, where zero-shot segmentation\npresents an option to account for data limitation. Initial exploratory works\nwith the Segment Anything Model (SAM) show that bounding-box-based prompting\npresents notable zero-short generalization. However, point-based prompting\nleads to a degraded performance that further deteriorates under image\ncorruption. We argue that SAM drastically over-segment images with high\ncorruption levels, resulting in degraded performance when only a single\nsegmentation mask is considered, while the combination of the masks overlapping\nthe object of interest generates an accurate prediction. Method: We use SAM to\ngenerate the over-segmented prediction of endoscopic frames. Then, we employ\nthe ground-truth tool mask to analyze the results of SAM when the best single\nmask is selected as prediction and when all the individual masks overlapping\nthe object of interest are combined to obtain the final predicted mask. We\nanalyze the Endovis18 and Endovis17 instrument segmentation datasets using\nsynthetic corruptions of various strengths and an In-House dataset featuring\ncounterfactually created real-world corruptions. Results: Combining the\nover-segmented masks contributes to improvements in the IoU. Furthermore,\nselecting the best single segmentation presents a competitive IoU score for\nclean images. Conclusions: Combined SAM predictions present improved results\nand robustness up to a certain corruption level. However, appropriate prompting\nstrategies are fundamental for implementing these models in the medical domain."
}