{
  "title": "CRISP: Contrastive Residual Injection and Semantic Prompting for\n  Continual Video Instance Segmentation",
  "authors": "Baichen Liu, Qi Lyu, Xudong Wang, Jiahua Dong, Lianqing Liu, Zhi Han",
  "year": 2025,
  "url": "http://arxiv.org/abs/2508.10432v1",
  "abstract": "Continual video instance segmentation demands both the plasticity to absorb\nnew object categories and the stability to retain previously learned ones, all\nwhile preserving temporal consistency across frames. In this work, we introduce\nContrastive Residual Injection and Semantic Prompting (CRISP), an earlier\nattempt tailored to address the instance-wise, category-wise, and task-wise\nconfusion in continual video instance segmentation. For instance-wise learning,\nwe model instance tracking and construct instance correlation loss, which\nemphasizes the correlation with the prior query space while strengthening the\nspecificity of the current task query. For category-wise learning, we build an\nadaptive residual semantic prompt (ARSP) learning framework, which constructs a\nlearnable semantic residual prompt pool generated by category text and uses an\nadjustive query-prompt matching mechanism to build a mapping relationship\nbetween the query of the current task and the semantic residual prompt.\nMeanwhile, a semantic consistency loss based on the contrastive learning is\nintroduced to maintain semantic coherence between object queries and residual\nprompts during incremental training. For task-wise learning, to ensure the\ncorrelation at the inter-task level within the query space, we introduce a\nconcise yet powerful initialization strategy for incremental prompts. Extensive\nexperiments on YouTube-VIS-2019 and YouTube-VIS-2021 datasets demonstrate that\nCRISP significantly outperforms existing continual segmentation methods in the\nlong-term continual video instance segmentation task, avoiding catastrophic\nforgetting and effectively improving segmentation and classification\nperformance. The code is available at https://github.com/01upup10/CRISP.",
  "citation": 0
}