{
  "url": "http://arxiv.org/abs/2302.14163v1",
  "title": "A Language-Guided Benchmark for Weakly Supervised Open Vocabulary\n  Semantic Segmentation",
  "authors": "Prashant Pandey, Mustafa Chasmai, Monish Natarajan, Brejesh Lall",
  "year": 2023,
  "abstract": "Increasing attention is being diverted to data-efficient problem settings\nlike Open Vocabulary Semantic Segmentation (OVSS) which deals with segmenting\nan arbitrary object that may or may not be seen during training. The closest\nstandard problems related to OVSS are Zero-Shot and Few-Shot Segmentation (ZSS,\nFSS) and their Cross-dataset variants where zero to few annotations are needed\nto segment novel classes. The existing FSS and ZSS methods utilize fully\nsupervised pixel-labelled seen classes to segment unseen classes. Pixel-level\nlabels are hard to obtain, and using weak supervision in the form of\ninexpensive image-level labels is often more practical. To this end, we propose\na novel unified weakly supervised OVSS pipeline that can perform ZSS, FSS and\nCross-dataset segmentation on novel classes without using pixel-level labels\nfor either the base (seen) or the novel (unseen) classes in an inductive\nsetting. We propose Weakly-Supervised Language-Guided Segmentation Network\n(WLSegNet), a novel language-guided segmentation pipeline that i) learns\ngeneralizable context vectors with batch aggregates (mean) to map class prompts\nto image features using frozen CLIP (a vision-language model) and ii) decouples\nweak ZSS/FSS into weak semantic segmentation and Zero-Shot segmentation. The\nlearned context vectors avoid overfitting on seen classes during training and\ntransfer better to novel classes during testing. WLSegNet avoids fine-tuning\nand the use of external datasets during training. The proposed pipeline beats\nexisting methods for weak generalized Zero-Shot and weak Few-Shot semantic\nsegmentation by 39 and 3 mIOU points respectively on PASCAL VOC and weak\nFew-Shot semantic segmentation by 5 mIOU points on MS COCO. On a harder setting\nof 2-way 1-shot weak FSS, WLSegNet beats the baselines by 13 and 22 mIOU points\non PASCAL VOC and MS COCO, respectively."
}