{
  "url": "http://arxiv.org/abs/2106.11653v5",
  "title": "A Curriculum-style Self-training Approach for Source-Free Semantic Segmentation",
  "authors": "Yuxi Wang, Jian Liang, Zhaoxiang Zhang",
  "year": 2021,
  "abstract": "Source-free domain adaptation has developed rapidly in recent years, where\nthe well-trained source model is adapted to the target domain instead of the\nsource data, offering the potential for privacy concerns and intellectual\nproperty protection. However, a number of feature alignment techniques in prior\ndomain adaptation methods are not feasible in this challenging problem setting.\nThereby, we resort to probing inherent domain-invariant feature learning and\npropose a curriculum-style self-training approach for source-free domain\nadaptive semantic segmentation. In particular, we introduce a curriculum-style\nentropy minimization method to explore the implicit knowledge from the source\nmodel, which fits the trained source model to the target data using certain\ninformation from easy-to-hard predictions. We then train the segmentation\nnetwork by the proposed complementary curriculum-style self-training, which\nutilizes the negative and positive pseudo labels following the\ncurriculum-learning manner. Although negative pseudo-labels with high\nuncertainty cannot be identified with the correct labels, they can definitely\nindicate absent classes. Moreover, we employ an information propagation scheme\nto further reduce the intra-domain discrepancy within the target domain, which\ncould act as a standard post-processing method for the domain adaptation field.\nFurthermore, we extend the proposed method to a more challenging black-box\nsource model scenario where only the source model's predictions are available.\nExtensive experiments validate that our method yields state-of-the-art\nperformance on source-free semantic segmentation tasks for both\nsynthetic-to-real and adverse conditions datasets. The code and corresponding\ntrained models are released at \\url{https://github.com/yxiwang/ATP}."
}