{
  "title": "PASS:Test-Time Prompting to Adapt Styles and Semantic Shapes in Medical\n  Image Segmentation",
  "authors": "Chuyan Zhang, Hao Zheng, Xin You, Yefeng Zheng, Yun Gu",
  "year": 2024,
  "url": "http://arxiv.org/abs/2410.01573v1",
  "abstract": "Test-time adaptation (TTA) has emerged as a promising paradigm to handle the\ndomain shifts at test time for medical images from different institutions\nwithout using extra training data. However, existing TTA solutions for\nsegmentation tasks suffer from (1) dependency on modifying the source training\nstage and access to source priors or (2) lack of emphasis on shape-related\nsemantic knowledge that is crucial for segmentation tasks.Recent research on\nvisual prompt learning achieves source-relaxed adaptation by extended parameter\nspace but still neglects the full utilization of semantic features, thus\nmotivating our work on knowledge-enriched deep prompt learning. Beyond the\ngeneral concern of image style shifts, we reveal that shape variability is\nanother crucial factor causing the performance drop. To address this issue, we\npropose a TTA framework called PASS (Prompting to Adapt Styles and Semantic\nshapes), which jointly learns two types of prompts: the input-space prompt to\nreformulate the style of the test image to fit into the pretrained model and\nthe semantic-aware prompts to bridge high-level shape discrepancy across\ndomains. Instead of naively imposing a fixed prompt, we introduce an input\ndecorator to generate the self-regulating visual prompt conditioned on the\ninput data. To retrieve the knowledge representations and customize\ntarget-specific shape prompts for each test sample, we propose a\ncross-attention prompt modulator, which performs interaction between target\nrepresentations and an enriched shape prompt bank. Extensive experiments\ndemonstrate the superior performance of PASS over state-of-the-art methods on\nmultiple medical image segmentation datasets. The code is available at\nhttps://github.com/EndoluminalSurgicalVision-IMR/PASS."
}