{
  "url": "http://arxiv.org/abs/2302.01735v5",
  "title": "Rethinking Semi-Supervised Medical Image Segmentation: A\n  Variance-Reduction Perspective",
  "authors": "Chenyu You, Weicheng Dai, Yifei Min, Fenglin Liu, David A. Clifton, S Kevin Zhou, Lawrence Hamilton Staib, James S Duncan",
  "year": 2023,
  "abstract": "For medical image segmentation, contrastive learning is the dominant practice\nto improve the quality of visual representations by contrasting semantically\nsimilar and dissimilar pairs of samples. This is enabled by the observation\nthat without accessing ground truth labels, negative examples with truly\ndissimilar anatomical features, if sampled, can significantly improve the\nperformance. In reality, however, these samples may come from similar\nanatomical regions and the models may struggle to distinguish the minority\ntail-class samples, making the tail classes more prone to misclassification,\nboth of which typically lead to model collapse. In this paper, we propose ARCO,\na semi-supervised contrastive learning (CL) framework with stratified group\ntheory for medical image segmentation. In particular, we first propose building\nARCO through the concept of variance-reduced estimation and show that certain\nvariance-reduction techniques are particularly beneficial in pixel/voxel-level\nsegmentation tasks with extremely limited labels. Furthermore, we theoretically\nprove these sampling techniques are universal in variance reduction. Finally,\nwe experimentally validate our approaches on eight benchmarks, i.e., five 2D/3D\nmedical and three semantic segmentation datasets, with different label\nsettings, and our methods consistently outperform state-of-the-art\nsemi-supervised methods. Additionally, we augment the CL frameworks with these\nsampling techniques and demonstrate significant gains over previous methods. We\nbelieve our work is an important step towards semi-supervised medical image\nsegmentation by quantifying the limitation of current self-supervision\nobjectives for accomplishing such challenging safety-critical tasks."
}