{
  "url": "http://arxiv.org/abs/2408.12957v3",
  "title": "Image Segmentation in Foundation Model Era: A Survey",
  "authors": "Tianfei Zhou, Wang Xia, Fei Zhang, Boyu Chang, Wenguan Wang, Ye Yuan, Ender Konukoglu, Daniel Cremers",
  "year": 2024,
  "abstract": "Image segmentation is a long-standing challenge in computer vision, studied\ncontinuously over several decades, as evidenced by seminal algorithms such as\nN-Cut, FCN, and MaskFormer. With the advent of foundation models (FMs),\ncontemporary segmentation methodologies have embarked on a new epoch by either\nadapting FMs (e.g., CLIP, Stable Diffusion, DINO) for image segmentation or\ndeveloping dedicated segmentation foundation models (e.g., SAM). These\napproaches not only deliver superior segmentation performance, but also herald\nnewfound segmentation capabilities previously unseen in deep learning context.\nHowever, current research in image segmentation lacks a detailed analysis of\ndistinct characteristics, challenges, and solutions associated with these\nadvancements. This survey seeks to fill this gap by providing a thorough review\nof cutting-edge research centered around FM-driven image segmentation. We\ninvestigate two basic lines of research -- generic image segmentation (i.e.,\nsemantic segmentation, instance segmentation, panoptic segmentation), and\npromptable image segmentation (i.e., interactive segmentation, referring\nsegmentation, few-shot segmentation) -- by delineating their respective task\nsettings, background concepts, and key challenges. Furthermore, we provide\ninsights into the emergence of segmentation knowledge from FMs like CLIP,\nStable Diffusion, and DINO. An exhaustive overview of over 300 segmentation\napproaches is provided to encapsulate the breadth of current research efforts.\nSubsequently, we engage in a discussion of open issues and potential avenues\nfor future research. We envisage that this fresh, comprehensive, and systematic\nsurvey catalyzes the evolution of advanced image segmentation systems. A public\nwebsite is created to continuously track developments in this fast advancing\nfield: \\url{https://github.com/stanley-313/ImageSegFM-Survey}.",
  "citation": 46
}