{
  "title": "Feature learning for efficient ASR-free keyword spotting in low-resource\n  languages",
  "authors": "Ewald van der Westhuizen, Herman Kamper, Raghav Menon, John Quinn, Thomas Niesler",
  "year": 2021,
  "url": "http://arxiv.org/abs/2108.06174v1",
  "abstract": "We consider feature learning for efficient keyword spotting that can be\napplied in severely under-resourced settings. The objective is to support\nhumanitarian relief programmes by the United Nations in parts of Africa in\nwhich almost no language resources are available. For rapid development in such\nlanguages, we rely on a small, easily-compiled set of isolated keywords. These\nkeyword templates are applied to a large corpus of in-domain but untranscribed\nspeech using dynamic time warping (DTW). The resulting DTW alignment scores are\nused to train a convolutional neural network (CNN) which is orders of magnitude\nmore computationally efficient and suitable for real-time application. We\noptimise this neural network keyword spotter by identifying robust acoustic\nfeatures in this almost zero-resource setting. First, we incorporate\ninformation from well-resourced but unrelated languages using a multilingual\nbottleneck feature (BNF) extractor. Next, we consider features extracted from\nan autoencoder (AE) trained on in-domain but untranscribed data. Finally, we\nconsider correspondence autoencoder (CAE) features which are fine-tuned on the\nsmall set of in-domain labelled data. Experiments in South African English and\nLuganda, a low-resource language, show that BNF and CAE features achieve a 5%\nrelative performance improvement over baseline MFCCs. However, using BNFs as\ninput to the CAE results in a more than 27% relative improvement over MFCCs in\nROC area-under-the-curve (AUC) and more than twice as many top-10 retrievals.\nWe show that, using these features, the CNN-DTW keyword spotter performs almost\nas well as the DTW keyword spotter while outperforming a baseline CNN trained\nonly on the keyword templates. The CNN-DTW keyword spotter using BNF-derived\nCAE features represents an efficient approach with competitive performance\nsuited to rapid deployment in a severely under-resourced scenario.",
  "citation": 30
}