{
  "url": "http://arxiv.org/abs/2210.08652v1",
  "title": "Adaptive Contrastive Learning with Dynamic Correlation for Multi-Phase\n  Organ Segmentation",
  "authors": "Ho Hin Lee, Yucheng Tang, Han Liu, Yubo Fan, Leon Y. Cai, Qi Yang, Xin Yu, Shunxing Bao, Yuankai Huo, Bennett A. Landman",
  "year": 2022,
  "abstract": "Recent studies have demonstrated the superior performance of introducing\n``scan-wise\" contrast labels into contrastive learning for multi-organ\nsegmentation on multi-phase computed tomography (CT). However, such scan-wise\nlabels are limited: (1) a coarse classification, which could not capture the\nfine-grained ``organ-wise\" contrast variations across all organs; (2) the label\n(i.e., contrast phase) is typically manually provided, which is error-prone and\nmay introduce manual biases of defining phases. In this paper, we propose a\nnovel data-driven contrastive loss function that adapts the similar/dissimilar\ncontrast relationship between samples in each minibatch at organ-level.\nSpecifically, as variable levels of contrast exist between organs, we\nhypothesis that the contrast differences in the organ-level can bring\nadditional context for defining representations in the latent space. An\norgan-wise contrast correlation matrix is computed with mean organ intensities\nunder one-hot attention maps. The goal of adapting the organ-driven correlation\nmatrix is to model variable levels of feature separability at different phases.\nWe evaluate our proposed approach on multi-organ segmentation with both\nnon-contrast CT (NCCT) datasets and the MICCAI 2015 BTCV Challenge\ncontrast-enhance CT (CECT) datasets. Compared to the state-of-the-art\napproaches, our proposed contrastive loss yields a substantial and significant\nimprovement of 1.41% (from 0.923 to 0.936, p-value$<$0.01) and 2.02% (from\n0.891 to 0.910, p-value$<$0.01) on mean Dice scores across all organs with\nrespect to NCCT and CECT cohorts. We further assess the trained model\nperformance with the MICCAI 2021 FLARE Challenge CECT datasets and achieve a\nsubstantial improvement of mean Dice score from 0.927 to 0.934\n(p-value$<$0.01). The code is available at: https://github.com/MASILab/DCC_CL",
  "citation": 1
}